# csv 출력 : to_csv()

import pandas as pd

data = {
    '2015' : [9904312, 3448737, 2890451, 2466052],
    '2010' : [9631482, 3393191, 2632035, 3431774],
    '2005' : [9762546, 3512547, 2517680, 2456016],
    '2000' : [9853972, 3655437, 2466338, 2473990],
    '지역' : ['수도권', '경상권', '수도권', '경상권'],
    '2010-2015증가율' : [0.0238, 0.0163, 0.0982, 0.0141]
}
columns = ['지역', '2015', '2015', '2005', '2000', '2010-2015증가율']
index = ['서울', '부산', '인천', '대구']
df = pd.DataFrame(data, index = index, columns = columns)

df.to_csv('sample6-1.csv') # sample6-1.csv 파일에 데이터프레임을 쓰기

df.index = ['a', 'b', 'c', 'd']
print(df)
df.to_csv('sample6-2.csv', index = False, header = False)
